; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-4nodes-1000size-3degree-100mindistance-2trucks-5packages-364seed

(define (problem transport-three-cities-sequential-4nodes-1000size-3degree-100mindistance-2trucks-5packages-364seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 722,189 -> 921,704
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 56)
  ; 921,704 -> 722,189
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 56)
  ; 833,932 -> 921,704
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 25)
  ; 921,704 -> 833,932
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 25)
  ; 782,736 -> 921,704
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 15)
  ; 921,704 -> 782,736
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 15)
  ; 782,736 -> 722,189
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 55)
  ; 722,189 -> 782,736
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 55)
  ; 782,736 -> 833,932
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 21)
  ; 833,932 -> 782,736
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 21)
  ; 2400,452 -> 2034,780
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 50)
  ; 2034,780 -> 2400,452
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 50)
  ; 2400,452 -> 2868,220
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 53)
  ; 2868,220 -> 2400,452
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 53)
  ; 2973,545 -> 2868,220
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 35)
  ; 2868,220 -> 2973,545
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 35)
  ; 2973,545 -> 2400,452
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 58)
  ; 2400,452 -> 2973,545
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 58)
  ; 1765,2315 -> 1928,2729
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 45)
  ; 1928,2729 -> 1765,2315
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 45)
  ; 1438,2996 -> 1049,2742
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 47)
  ; 1049,2742 -> 1438,2996
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 47)
  ; 1438,2996 -> 1928,2729
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 56)
  ; 1928,2729 -> 1438,2996
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 56)
  ; 921,704 <-> 2034,780
  (road city-1-loc-1 city-2-loc-1)
  (= (road-length city-1-loc-1 city-2-loc-1) 112)
  (road city-2-loc-1 city-1-loc-1)
  (= (road-length city-2-loc-1 city-1-loc-1) 112)
  (road city-1-loc-1 city-3-loc-1)
  (= (road-length city-1-loc-1 city-3-loc-1) 112)
  (road city-3-loc-1 city-1-loc-1)
  (= (road-length city-3-loc-1 city-1-loc-1) 112)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 112)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 112)
  (at package-1 city-3-loc-4)
  (at package-2 city-3-loc-2)
  (at package-3 city-3-loc-3)
  (at package-4 city-1-loc-2)
  (at package-5 city-3-loc-4)
  (at truck-1 city-2-loc-2)
  (capacity truck-1 capacity-4)
  (at truck-2 city-3-loc-2)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-1-loc-4)
  (at package-2 city-1-loc-1)
  (at package-3 city-3-loc-1)
  (at package-4 city-3-loc-3)
  (at package-5 city-3-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-2 city-3-loc-2 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-3-loc-2) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 5
2. (drive truck-2 city-3-loc-2 city-3-loc-4)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-3-loc-4)
   goals met: 0 of 5
3. (pick-up truck-2 city-3-loc-4 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-3-loc-4) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 5
4. (drive truck-2 city-3-loc-4 city-3-loc-1)
   deleted: (at truck-2 city-3-loc-4)
   added: (at truck-2 city-3-loc-1)
   goals met: 0 of 5
5. (drive truck-2 city-3-loc-1 city-1-loc-1)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 5
6. (drop truck-2 city-1-loc-1 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-0)
   added: (at package-2 city-1-loc-1) (capacity truck-2 capacity-1)
   goals met: 1 of 5
7. (drive truck-2 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-4)
   goals met: 1 of 5
8. (drop truck-2 city-1-loc-4 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-1-loc-4) (capacity truck-2 capacity-2)
   goals met: 2 of 5
9. (drive truck-2 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-2)
   goals met: 2 of 5
10. (pick-up truck-2 city-1-loc-2 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-2) (capacity truck-2 capacity-2)
   added: (in package-4 truck-2) (capacity truck-2 capacity-1)
   goals met: 2 of 5
11. (drive truck-2 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-1)
   goals met: 2 of 5
12. (drive truck-2 city-1-loc-1 city-3-loc-1)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-3-loc-1)
   goals met: 2 of 5
13. (drive truck-2 city-3-loc-1 city-3-loc-4)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-3-loc-4)
   goals met: 2 of 5
14. (pick-up truck-2 city-3-loc-4 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-3-loc-4) (capacity truck-2 capacity-1)
   added: (in package-5 truck-2) (capacity truck-2 capacity-0)
   goals met: 2 of 5
15. (drive truck-2 city-3-loc-4 city-3-loc-2)
   deleted: (at truck-2 city-3-loc-4)
   added: (at truck-2 city-3-loc-2)
   goals met: 2 of 5
16. (drive truck-2 city-3-loc-2 city-3-loc-3)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-3-loc-3)
   goals met: 2 of 5
17. (drop truck-2 city-3-loc-3 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-0)
   added: (at package-4 city-3-loc-3) (capacity truck-2 capacity-1)
   goals met: 3 of 5
18. (drop truck-2 city-3-loc-3 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-1)
   added: (at package-5 city-3-loc-3) (capacity truck-2 capacity-2)
   goals met: 4 of 5
19. (pick-up truck-2 city-3-loc-3 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-3-loc-3) (capacity truck-2 capacity-2)
   added: (in package-3 truck-2) (capacity truck-2 capacity-1)
   goals met: 4 of 5
20. (drive truck-2 city-3-loc-3 city-3-loc-2)
   deleted: (at truck-2 city-3-loc-3)
   added: (at truck-2 city-3-loc-2)
   goals met: 4 of 5
21. (drive truck-2 city-3-loc-2 city-3-loc-4)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-3-loc-4)
   goals met: 4 of 5
22. (drive truck-2 city-3-loc-4 city-3-loc-1)
   deleted: (at truck-2 city-3-loc-4)
   added: (at truck-2 city-3-loc-1)
   goals met: 4 of 5
23. (drop truck-2 city-3-loc-1 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-1)
   added: (at package-3 city-3-loc-1) (capacity truck-2 capacity-2)
   goals met: 5 of 5
